Autodesk.Revit.DB.TextNoteLeaderTypes
An enumerated type listing all the Leader types.

Autodesk.Revit.DB.TextNoteLeaderTypes.TNLT_ARC_R
The leader is put at the right of the Text object and in the arc style.

Autodesk.Revit.DB.TextNoteLeaderTypes.TNLT_ARC_L
The leader is put at the left of the Text object and in the arc style.

Autodesk.Revit.DB.TextNoteLeaderTypes.TNLT_STRAIGHT_R
The leader is put at the right of the Text object and in the straight style.

Autodesk.Revit.DB.TextNoteLeaderTypes.TNLT_STRAIGHT_L
The leader is put at the left of the Text object and in the straight style.